# 1. Вывести на экран текст "Silence is golden".

s = "Silence is golden"

print(s)