# 10.Вычислите значение выражения (x+1)2+3(x+1) при:
# а) x=1.7;
# б) x=3.
# Ответ:
# а) 15.39
# б) 28
import math

x = 1.7
x = 3
expression = (x + 1) ** 2 + 3 * (x + 1)
print(expression)
