# 8.Вычислите значение выражения (a+4b)(a−3b)+a**2 при a=2 и b=3
# Ответ:  -94
a = 2
b = 3
x1 = a + 4 * b
x2 = a - 3 * b
print((x1 * x2) + a ** 2)
