# 9. Вычислите |x|+x**5, если x=−2. Ответ: -30

x = -2

print(abs(x) + x ** 5)
